app/controllers/cities_controller.rb

  def create
    city = City.create city_params
---
INSERT INTO "cities" ("name", "image", "population", "house_id", "region_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

  def edit
  @city = City.find params[:id]
---
SELECT  "cities".* FROM "cities" WHERE "cities"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

  def update
  city = City.find params[:id]
  city.update city_params
---
SELECT  "cities".* FROM "cities" WHERE "cities"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "cities" SET "image" = $1, "updated_at" = $2 WHERE "cities"."id" = $3  [["image", "https://vignette.wikia.nocookie.net/gameofthrones/images/f/ff/S05E06_-_King%27s_Landing.jpg/revision/latest?cb=20170313212331"], ["updated_at", "2018-04-05 18:44:56.399856"], ["id", 1]]

  def show
    @city = City.find params[:id]
---
SELECT  "cities".* FROM "cities" WHERE "cities"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]