app/controllers/houses_controller.rb

  def create
    house = House.create house_params
---
INSERT INTO "houses" ("name", "lord", "heir", "words", "image", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

  def update
    house = House.find params[:id]
    house.update house_params
---
UPDATE "houses" SET "lord" = $1, "heir" = $2, "updated_at" = $3 WHERE "houses"."id" = $4  [["lord", "markous clegane"], ["heir", "jimm,y johnson"], ["updated_at", "2018-04-05 05:47:12.959453"], ["id", 7]]

  def destroy
    house = House.find params[:id]
    house.destroy
---
DELETE FROM "houses" WHERE "houses"."id" = $1  [["id", 6]]