app/controllers/regions_controller.rb

SELECT "regions".* FROM "regions"
---
  def index
    @regions = Region.all

INSERT INTO "regions" ("name", "culture", "religion", "capital", "image", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    region = Region.create region_params

SELECT  "regions".* FROM "regions" WHERE "regions"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @region = Region.find params[:id]

SELECT  "regions".* FROM "regions" WHERE "regions"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @region = Region.find params[:id]