app/views/cities/_form.html.erb

<%= f.label :region_id %>
<%= f.select :region_id, Region.pluck(:name, :id), :include_blank => true %> <!-- provides a selection of Regions that can be linked to the city being created -->
---
SELECT "regions"."name", "regions"."id" FROM "regions"